In [16]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn import metrics

In [17]:
data=pd.read_csv("medical.csv")
data

      age     sex     bmi  children smoker    region      charges
0      19  female  27.900         0    yes      Pune  16884.92400
1      18    male  33.770         1     no    Nagpur   1725.55230
2      28    male  33.000         3     no    Nagpur   4449.46200
3      33    male  22.705         0     no  Kolhapur  21984.47061
4      32    male  28.880         0     no  Kolhapur   3866.85520
...   ...     ...     ...       ...    ...       ...          ...
1333   50    male  30.970         3     no  Kolhapur  10600.54830
1334   18  female  31.920         0     no    Mumbai   2205.98080
1335   18  female  36.850         0     no    Nagpur   1629.83350
1336   21  female  25.800         0     no      Pune   2007.94500
1337   61  female  29.070         0    yes  Kolhapur  29141.36030

[1338 rows x 7 columns]

In [18]:
data.shape

(1338, 7)

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [20]:
data.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [21]:
data.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [22]:
data['sex'].unique()

array(['female', 'male'], dtype=object)

In [23]:
data["sex"]=data["sex"].map({'female':0, 'male':1})

In [24]:
data.head()

   age  sex     bmi  children smoker    region      charges
0   19    0  27.900         0    yes      Pune  16884.92400
1   18    1  33.770         1     no    Nagpur   1725.55230
2   28    1  33.000         3     no    Nagpur   4449.46200
3   33    1  22.705         0     no  Kolhapur  21984.47061
4   32    1  28.880         0     no  Kolhapur   3866.85520

In [25]:
data["smoker"]=data["smoker"].map({'no':0, 'yes':1})

In [26]:
data.head()

   age  sex     bmi  children  smoker    region      charges
0   19    0  27.900         0       1      Pune  16884.92400
1   18    1  33.770         1       0    Nagpur   1725.55230
2   28    1  33.000         3       0    Nagpur   4449.46200
3   33    1  22.705         0       0  Kolhapur  21984.47061
4   32    1  28.880         0       0  Kolhapur   3866.85520

In [27]:
data['region'].unique()

array(['Pune', 'Nagpur', 'Kolhapur', 'Mumbai'], dtype=object)

In [28]:
data["region"]=data["region"].map({'Pune':1, 'Nagpur':2, 'Kolhapur':3, 'Mumbai':4})

In [29]:
X = data.drop(columns='charges', axis=1)
X

      age  sex     bmi  children  smoker  region
0      19    0  27.900         0       1       1
1      18    1  33.770         1       0       2
2      28    1  33.000         3       0       2
3      33    1  22.705         0       0       3
4      32    1  28.880         0       0       3
...   ...  ...     ...       ...     ...     ...
1333   50    1  30.970         3       0       3
1334   18    0  31.920         0       0       4
1335   18    0  36.850         0       0       2
1336   21    0  25.800         0       0       1
1337   61    0  29.070         0       1       3

[1338 rows x 6 columns]

In [30]:
y = data['charges']
y

0       16884.92400
1        1725.55230
2        4449.46200
3       21984.47061
4        3866.85520
           ...
1333    10600.54830
1334     2205.98080
1335     1629.83350
1336     2007.94500
1337    29141.36030
Name: charges, Length: 1338, dtype: float64

In [31]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=2)

In [32]:
lr=LinearRegression()
lr.fit(X_train,y_train)

LinearRegression()

In [33]:
y_pred1=lr.predict(X_test)
y_pred1

array([ 1885.54165174, 11944.32273357, 10455.55488707,  2397.96696161,
        8271.55347048, 11234.41036809,  3376.43169724,  1072.63123623,
       12060.51395933,  9468.23322457, 11494.97066851,  5053.0305502 ,
       30093.5527384 ,  -228.58148206, 12784.84199754, 13402.21956446,
        4179.28948043,  7740.09899682, 29568.66245635,  2738.01455718,
       12343.38521075,  1881.51269934, 34087.95253065, 32103.24119851,
       30445.32061394,  8632.58788645,  2298.01995336, 15417.01187725,
        6168.10928884,  1942.95830544,  9636.84483913,  5642.81556233,
        4058.10854408,  4853.19902886,  9764.94270973,  4755.04190386,
       30007.20570516,  6403.4791383 , 27582.56773006, 14149.40158117,
         151.96770571, 28000.88252814,  7724.4555082 ,  1093.99727743,
       10434.24794603,  7636.92275042, 11467.16787872,  8328.38879353,
       10915.23415866, 13408.79328   ,  6150.60763788, -1131.05313916,
       26163.22877049, 36999.48645124,  6988.24506067, 17480.13399005,
        1018.83694558, 11202.85589973,  1775.35390886, 34195.62805741,
       11482.93499856,   489.95740987,  3859.74367758, 36051.47915417,
       -1428.73834052, 14328.37292632, 14447.33699801,  3547.73959496,
       13086.4043211 , 11047.27999843, 11195.05001964, 16319.16806083,
       10029.69471548,  9522.20376728, 15522.39790841, 12002.45799506,
        4004.69702408,  3510.12174794,  5490.17653227, 13128.9199443 ,
        8771.82281042, 12309.46045053,  9667.79765657, 27287.68697984,
       12790.05452343,  3828.26275901, 38670.29110584, 11019.60083986,
        8452.47984123, 11229.41055335, 11339.4032459 , 14744.9636076 ,
       11255.03748123, 13436.6866804 ,  5675.68835376, 25774.18377058,
        4802.47207367, 10695.16392711,  3083.49609515, 29128.1781461 ,
        6744.14121214,  3621.45701886,  2284.90090761, 16142.63905509,
        7743.99450366,  9909.25632884,  9809.85561134,  5217.94371569,
       15243.60845691, 34129.65579923,  3932.05307004, 11135.43095089,
       24974.58491491, 15196.34870014,  2109.56802097, 10238.04244103,
        8827.26636406,  6118.09284474, 11453.00870576, 28992.60115388,
        6185.07119212,  6796.38004975, 16007.47097303, 16618.20181147,
        8413.48368377, 26675.27315058, 35422.17964258, 11480.17024933,
        7928.5040558 ,  9505.55610531,  8313.45553744,  3299.55807657,
        2939.66896258,  4531.09220084,  8171.97567366,  8385.88030102,
        7196.89330173, 28798.69273278, 34783.89321682,  4004.80792333,
       27471.72298415,  4000.98272662,  6467.74992944, 13471.79662831,
        7640.81825725, 36599.60475814, 11632.338848  , 11176.81793909,
        8132.94575674,   139.36211328,  6128.3827736 ,  7343.67722403,
        4791.42565069, 11272.08677524, 11459.58372532, 15629.94726772,
        6221.72900476, 28022.48030541,  1817.25727984, 11850.04403479,
       17348.8574798 , 14093.51075429,  9135.77746229,  2643.67726663,
        4252.29103098,  9091.64865318, 19165.47389035, 28619.39904963,
       13039.98721697,  3108.76523149, 32669.04229311, 12723.2025417 ,
       33140.28344844, 34726.63313521, 11535.8676401 ,  7199.88544155,
        3024.22410514,  2738.01455718, 11807.82226082,  7517.80179646,
        2755.99762284,   996.35903981, 31500.42047313,  6981.97510029,
        5701.96925175, 27133.30941183,  6975.90000327,  2806.78733149,
        7756.08876538, 35216.05656821,  8145.26232535,  4480.71969408,
        9630.20617573, 27232.90944478,  6088.13270089, 40327.75571182,
       37083.16692232, 13381.78417846, 26961.74999462, 12285.99199376,
       37601.19299442,  7241.19040128,  4044.28958536,  1809.38543828,
       14457.64541495, 13847.63368951,  2545.43395147, 35826.12909961,
       12424.11686557,  8899.08300547,   747.97468776, 30768.7660853 ,
        3869.007392  ,  3833.5970121 , 12437.58188106, 14919.93398073,
       29278.44958711,  -475.84225118,  3336.07577736,  8301.60736115,
       40115.68844976,  8381.46393953, 35473.32544551, 27087.81718701,
       13568.80908294, 29028.31497875, 16893.22465803,  7775.19510378,
       15988.04055919,  7290.41681042, 10608.67726746,  3334.72630606,
        8423.76097226,  1750.4597282 , 32990.56624809, 31881.92819305,
       14441.70241637, 11037.05552582,  1382.84301454,  6137.49001937,
       10799.15221794,  4326.30554377, 10613.54039697,   661.59126724,
       34713.28762089, 32561.54987973, 10371.33933838, 26484.49202386,
       12661.21629752,  2113.0352194 , 10822.99887005,  2800.8592108 ,
        7898.64937714, 10288.02896912, 16725.91611812,  5619.38226062,
       10164.23107528,  -156.85099917, -1979.34595418,  1515.03753962,
       27904.40808058, 33822.00624667, 37719.74320731, -2054.82719361,
       16088.03494606, 36783.48306159, 13147.66223851, 33998.49281923])

In [36]:
lr=LinearRegression()
lr.fit(X,y)

LinearRegression()

In [37]:
import joblib

In [38]:
joblib.dump(lr,'model_joblib_lr')

['model_joblib_lr']

In [39]:
model=joblib.load('model_joblib_lr')

In [43]:

def show_entry():
  p1=float(nameInput.get())
  p2=float(nameInput1.get())
  p3=float(nameInput2.get())
  p4=float(nameInput3.get())  
  p5=float(nameInput4.get())
  p6=float(nameInput5.get()) 
  
  model=joblib.load('model_joblib_lr')
  result=model.predict([[p1,p2,p3,p4,p5,p6]])
    
  cname6=Label(master,text="cost").grid(row=7,column=0)
  cname6=Label(master,text=result)
  cname6.grid(row=7,column=1)


  
master=Tk()
import joblib
from tkinter import *
from tkinter import ttk,messagebox
master.geometry('500x500')


label=master.title("Medical Insurance Cost Predication")

cname=Label(master,text="Enter your age ")
cname.grid(row=0,column=0)

cname1=Label(master,text="Male or Female[1/0] ")
cname1.grid(row=1,column=0)

cname2=Label(master,text="Enter Your BMI Value ")
cname2.grid(row=2,column=0)

cname3=Label(master,text="Enter Number of Children")
cname3.grid(row=3,column=0)

cname4=Label(master,text=" Do you smoke yes/No[1/0] ")
cname4.grid(row=4,column=0)

cname5=Label(master,text="Enter your region[1-4] ")
cname5.grid(row=5,column=0)



nameInput=Entry(master)
nameInput.grid(row=0,column=1)

nameInput1=Entry(master)
nameInput1.grid(row=1,column=1)

nameInput2=Entry(master)
nameInput2.grid(row=2,column=1)

nameInput3=Entry(master)
nameInput3.grid(row=3,column=1)

nameInput4=Entry(master)
nameInput4.grid(row=4,column=1)

nameInput5=Entry(master)
nameInput5.grid(row=5,column=1)

Button(master,text="Predict",command=show_entry).grid(row=6,column=0)

master.mainloop()